{
  "backend/main.mo": "Motoko actor that stores and manages contact form submissions with fields like name, email, and message, supporting retrieval sorted by timestamp ascending or descending.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (design system, premium UI, navbar/footer, etc.) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend page and shared component file, noting key implementation details and bug fixes like Rules of Hooks violations.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens, radii, and sidebar variables used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the UNAI React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all page routes, wraps the app in a ThemeProvider, and renders the global layout with Navbar, Footer, CustomCursor, and PageLoadAnimation.",
  "frontend/src/components/CustomCursor.tsx": "Custom cursor component rendering a dot and trailing ring that follow the mouse, scaling up on hoverable elements like links and buttons.",
  "frontend/src/components/Footer.tsx": "Global footer component with the UNAI brand, navigation links split into two columns, social media icons, and a bottom copyright bar.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass morphism card component supporting optional dark variant, click handler, custom className, and inline style prop.",
  "frontend/src/components/Navbar.tsx": "Sticky global navbar with the UNAI logo, desktop navigation links with active underline indicator, dark/light theme toggle, a 'Talk to Us' CTA, and a collapsible mobile menu.",
  "frontend/src/components/PageLoadAnimation.tsx": "Displays a full-screen branded splash animation on first page load per session, auto-dismissing after 2.2 seconds and storing a flag in sessionStorage to prevent repeat shows.",
  "frontend/src/components/SectionDivider.tsx": "Renders a decorative horizontal divider with a centered star icon and flanking lines/dots, supporting light and dark color variants via props.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for submitting a contact form (`useSubmitContact`) and fetching stored contacts (`useGetContacts`) via the ICP backend actor.",
  "frontend/src/hooks/useScrollReveal.ts": "Custom hook that uses IntersectionObserver to add a 'visible' CSS class to a referenced element when it scrolls into view, then stops observing it.",
  "frontend/src/index.css": "Global stylesheet defining the UNAI brand color palette, OKLCH design tokens for light/dark modes, Tailwind base/component/utility layers, and custom utility classes like glassmorphism effects and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/About.tsx": "About page rendering company timeline, team members, core values, statistics, and philosophy pillars using scroll-reveal animations and GlassCard components.",
  "frontend/src/pages/Careers.tsx": "Careers page displaying company culture, employee benefits, and open job positions with expandable descriptions, built with scroll-reveal animations and GlassCard components.",
  "frontend/src/pages/Contact.tsx": "Contact page with a validated form (name, company, email, phone, message) that submits via the `useSubmitContact` mutation hook, showing a success state on completion alongside static contact info cards.",
  "frontend/src/pages/Events.tsx": "Events listing page displaying a static array of upcoming events with category filter tabs (All, Conferences, Product Launches, Tech Summits, Webinars) and a parallax hero banner.",
  "frontend/src/pages/Gallery.tsx": "Gallery page rendering a filterable image grid (All, Events, Products, Office, Webinars) from a static list of generated asset paths with category color badges.",
  "frontend/src/pages/Home.tsx": "Home landing page featuring a parallax hero section, services grid, product previews, and upcoming events, all using scroll-reveal animations and static data arrays.",
  "frontend/src/pages/Products.tsx": "Products page showcasing three UNAI products (Nexus, Pulse, Core) in alternating image/content layouts plus a feature comparison matrix table across all three products.",
  "frontend/src/pages/Services.tsx": "Defines the Services page with five service blocks (AI, Enterprise, Cloud, Data, Consulting) and a six-step process section, using scroll-reveal animations, alternating layouts, and GlassCard components.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with UNAI brand colors, custom fonts (Playfair Display, Inter), glass/soft shadows, spacing tokens, border radii, and animation keyframes; includes typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks overall project state for the UNAI corporate website, documenting architecture decisions (8 pages, color palette, typography, parallax strategy, UI components) and listing all required image assets with dimensions."
}